# SQL Assignment 5

Q-1. Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

In [1]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'ORG',user="root", passwd="root",use_pure=True)
    query = "Select * from Worker where FIRST_NAME not in ('Vipul','Satish')"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

Q-2. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

In [6]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'ORG',user="root", passwd="root",use_pure=True)
    query = "Select * from Worker where FIRST_NAME like '_____h'"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account

Q-3. Write a query to validate Email of Employee.

In [9]:
import mysql.connector as connection
import pandas as pandas

try:
    mydb = connection.connect(host="localhost", database = 'employee',user="root", passwd="root",use_pure=True)
    query = "Select * from Worker where EMAIL_ID like '%@worker.com'"
    result_dataFrame = pandas.read_sql(query,mydb)
    print(result_dataFrame)
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

    WORKER_ID FIRST_NAME LAST_NAME  GENDER  DEPARTMENT DATE_OF_JOINING  \
0           1       Mila     Kunis  Female          HR      2021-07-10
1           2       Tina       Miu  Female          IT      2020-06-19
2           3        Zim      Mial    Male  Consultant      1990-05-01
3           4        Sam     Smith    Male     Finance      1989-04-20
4           5        Pam     Pmith  Female          IT      2005-12-19
5           6        Ram     Rmith    Male     Finance      2011-11-30
6           8        Nam     Nmith    Male     Finance      2011-06-05
7           9        Bam     Bmith    Male          HR      2012-06-11
8          70        Jam     Jmith  Female          IT      2001-10-29
9         100        Cam     Cmith    Male          IT      2014-09-17
10        200        Dam     Dmith    Male     Finance      1997-01-02
11        300        Eam     Emith  Female   Transport      1994-02-28
12        400        Fam     Fmith    Male     Finance      2019-07-19

    SALARY               EMAIL_ID
0    15000  mila.kunis@worker.com
1    25000    tina.miu@worker.com
2    21000    zim.mial@worker.com
3    30000   sam.smith@worker.com
4    22000   pam.pmith@worker.com
5    26000   ram.rmith@worker.com
6    78000   nam.nmith@worker.com
7    19000   bam.bmith@worker.com
8    40000   jam.jmith@worker.com
9    12000   cam.cmith@worker.com
10    5000   dam.dmith@worker.com
11   89000   eam.emith@worker.com
12   11000   fam.fmith@worker.com